Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.pterodactyl_panel.kubernetes_deployment_v1.deployment will be updated in-place
~ resource "kubernetes_deployment_v1" "deployment" {
        id               = "pterodactyl/pterodactyl-panel"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/pterodactyl/panel:v1.12.2" -> "ghcr.io/pterodactyl/panel:v1.12.1"
                        name                       = "pterodactyl-panel"
                        # (10 unchanged attributes hidden)

                        # (27 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.rancher-helm.helm_release.deployment will be updated in-place
~ resource "helm_release" "deployment" {
      ~ id                         = "rancher" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v2.13.3" -> (known after apply)
          ~ chart          = "rancher" -> (known after apply)
          ~ first_deployed = 1751334206 -> (known after apply)
          ~ last_deployed  = 1772774097 -> (known after apply)
          ~ name           = "rancher" -> (known after apply)
          ~ namespace      = "cattle-system" -> (known after apply)
          ~ notes          = <<-EOT
                Rancher Server has been upgraded. Rancher may take several minutes to fully initialize.
                
                Please standby while Certificates are being issued, Containers are started and the Ingress rule comes up.
                
                Check out our docs at https://rancher.com/docs/
                
                ## First Time Login
                
                If you provided your own bootstrap password during installation, browse to https://rancher.hozzlab.ca to get started.
                If this is the first time you installed Rancher, get started by running this command and clicking the URL it generates:
                
                ```
                echo https://rancher.hozzlab.ca/dashboard/?setup=$(kubectl get secret --namespace cattle-system bootstrap-secret -o go-template='{{.data.bootstrapPassword|base64decode}}')
                ```
                
                To get just the bootstrap password on its own, run:
                
                ```
                kubectl get secret --namespace cattle-system bootstrap-secret -o go-template='{{.data.bootstrapPassword|base64decode}}{{ "\n" }}'
                ```
                
                
                Happy Containering!
            EOT -> (known after apply)
          ~ revision       = 19 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - hostname = "rancher.hozzlab.ca"
                  - ingress  = {
                      - tls = {
                          - secretName = "tls-rancher-ingress"
                          - source     = "secret"
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "2.13.3" -> (known after apply)
        } -> (known after apply)
        name                       = "rancher"
      ~ version                    = "2.13.3" -> "2.14.0"
        # (30 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.hozzlab.ca/lock?id=rbmfullerton-ca%252Fhomelab%252F.%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```